darwin.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Darwin (OS X)</title>
<!-- 2016-08-19 Fri 09:57 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Jonathan Arkell" />
<link href="https://fonts.googleapis.com/css?family=Inconsolata|Nixie+One|Taviraj:300,400" rel="stylesheet"><link href="./assets/style.css" rel="stylesheet">
</head>
<body>
<div id="content">
<h1 class="title">Darwin (OS X)</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. Fixes</a>
<ul>
<li><a href="#sec-1-1">1.1. Fix info path to work with homebrew</a></li>
<li><a href="#sec-1-2">1.2. Fix broken colors on emacs for mac os x</a></li>
</ul>
</li>
<li><a href="#sec-2">2. Interface</a>
<ul>
<li><a href="#sec-2-1">2.1. Remap "hyper" to be meta</a></li>
</ul>
</li>
<li><a href="#sec-3">3. Integrations</a>
<ul>
<li><a href="#sec-3-1">3.1. Assuming a standard latex setup</a>
<ul>
<li><a href="#sec-3-1-1">3.1.1. You will want to get the latest version of mactex to make this go:</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Fixes</h2>
<div class="outline-text-2" id="text-1">
</div><div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="section-number-3">1.1</span> Fix info path to work with homebrew</h3>
<div class="outline-text-3" id="text-1-1">
<p>
But this does&#x2026; after going to the actual download dir and doing a <code>make install-info</code>
</p>

<div class="org-src-container">

<pre class="src src-emacs-lips">(add-to-list 'Info-directory-list "/usr/local/info")
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-1-2" class="outline-3">
<h3 id="sec-1-2"><span class="section-number-3">1.2</span> Fix broken colors on emacs for mac os x</h3>
<div class="outline-text-3" id="text-1-2">
<div class="org-src-container">

<pre class="src src-emacs-lisp">(<span class="org-keyword">when</span> (fboundp 'ns-list-colors)&#57344;&#57345;&#57345;
  (setq x-colors (ns-list-colors)))&#57344;&#57345;&#57345;
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Interface</h2>
<div class="outline-text-2" id="text-2">
</div><div id="outline-container-sec-2-1" class="outline-3">
<h3 id="sec-2-1"><span class="section-number-3">2.1</span> Remap "hyper" to be meta</h3>
<div class="outline-text-3" id="text-2-1">
<div class="org-src-container">

<pre class="src src-emacs-lisp">(setq mac-command-modifier 'meta)&#57344;&#57345;&#57345;
(setq mac-option-modifier 'meta)&#57344;&#57345;&#57345;
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> Integrations</h2>
<div class="outline-text-2" id="text-3">
</div><div id="outline-container-sec-3-1" class="outline-3">
<h3 id="sec-3-1"><span class="section-number-3">3.1</span> Assuming a standard latex setup</h3>
<div class="outline-text-3" id="text-3-1">
<div class="org-src-container">

<pre class="src src-emacs-lisp">(setq org-latex-to-pdf-process &#57344;&#57345;&#57345;
      '(<span class="org-string">"/usr/texbin/pdflatex -interaction nonstopmode -output-directory %o %f"</span>))&#57345;
</pre>
</div>
</div>
<div id="outline-container-sec-3-1-1" class="outline-4">
<h4 id="sec-3-1-1"><span class="section-number-4">3.1.1</span> You will want to get the latest version of mactex to make this go:</h4>
<div class="outline-text-4" id="text-3-1-1">
<p>
<a href="http://www.tug.org/mactex/">http://www.tug.org/mactex/</a>
</p>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Jonathan Arkell</p>
<p class="date">Created: 2016-08-19 Fri 09:57</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 24.5.1 (<a href="http://orgmode.org">Org</a> mode 8.2.10)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
